Revit 2027 API
BuiltInFailures.SystemsFailures.CreatePartsWithoutDabasebase Property
 Parts were not created because fabrication configuration is not available.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CreatePartsWithoutDabasebase { get; }
Public Shared ReadOnly Property CreatePartsWithoutDabasebase As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CreatePartsWithoutDabasebase {
	FailureDefinitionId^ get ();
}
static member CreatePartsWithoutDabasebase : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SystemsFailures Class
Autodesk.Revit.DB Namespace